# dfem_net.yaml
nc: 80  # number of classes
scales: # model compound scaling constants (same as YOLOv8n)
  n: [0.33, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, TuaBottleneck, [128, True]] # 2. REPLACED C2f with TuaBottleneck
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, TuaBottleneck, [256, True]] # 4. REPLACED C2f with TuaBottleneck
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, TuaBottleneck, [512, True]] # 6. REPLACED C2f with TuaBottleneck
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, TuaBottleneck, [1024, True]] # 8. REPLACED C2f with TuaBottleneck
  - [-1, 1, SPPF, [1024, 5]]   # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]        # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]        # 15 (P3)

  # --- INSERT SCALSEQ MODULE ---
  # Takes P3 (15), P4 (12), and P5 (9)
  - [[15, 12, 9], 1, Scalseq, [256, 512, 1024]] # 16

  # --- INSERT ZOOMCAT MODULE ---
  # Takes the fused features
  - [-1, 1, Zoomcat, []] # 17

  - [[15, 12, 9], 1, Detect, [nc]] # Detect using P3, P4, P5