# DFEM-Net Configuration (Scaled Explicitly for Nano)
# Manual scaling applied (0.25 width) to prevent parser mismatches.

nc: 80
# REMOVED scales section to force explicit channel counts

backbone:
  # [from, repeats, module, args]
  # Manual Scaling: 64->16, 128->32, 256->64, 512->128, 1024->256
  
  - [-1, 1, Conv, [16, 3, 2]]  # 0-P1/2 (Was 64)
  - [-1, 1, Conv, [32, 3, 2]]  # 1-P2/4 (Was 128)
  - [-1, 3, TuaBottleneck, [32, 32, True]] # 2 (Was 128)
  - [-1, 1, Conv, [64, 3, 2]]  # 3-P3/8 (Was 256)
  - [-1, 6, TuaBottleneck, [64, 64, True]] # 4 (Was 256)
  - [-1, 1, Conv, [128, 3, 2]] # 5-P4/16 (Was 512)
  - [-1, 6, TuaBottleneck, [128, 128, True]] # 6 (Was 512)
  - [-1, 1, Conv, [256, 3, 2]] # 7-P5/32 (Was 1024)
  - [-1, 3, TuaBottleneck, [256, 256, True]] # 8 (Was 1024)
  - [-1, 1, SPPF, [256, 5]]   # 9 (Was 1024)

head:
  # --- Upstream ---
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 3, C2f, [128]]        # 12 (Was 512)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  
  - [-1, 3, C2f, [64]]         # 15 (Was 256)

  # --- ROUTER FIX (Upsampling Inputs) ---
  - [12, 1, nn.Upsample, [None, 2, 'nearest']] # 16 (P4 up)
  - [9, 1, nn.Upsample, [None, 4, 'nearest']]  # 17 (P5 up)

  # 18. Concat P3(15), P4_up(16), P5_up(17)
  # Channels: 64 + 128 + 256 = 448
  - [[15, 16, 17], 1, Concat, [1]] 

  # --- SCALSEQ ---
  # Args: [64, 128, 256] (Scaled P3, P4, P5)
  - [18, 1, Scalseq, [64, 128, 256]] # 19

  # --- ZOOMCAT ---
  # Input channels is 64 (because Scalseq outputs 64)
  # Note: Scalseq usually maintains the channel width of the smallest input (P3)
  - [-1, 1, Zoomcat, [64]] # 20

  # --- DETECT HEAD ---
  # Using layers 15, 12, 9
  - [[15, 12, 9], 1, Detect, [nc]]